config/cf/Catalogs/TelegramДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>TelegramДействия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчиститьВсеПараметры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.TelegramПараметрыДействий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.TelegramДействияСПараметром</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.TelegramПараметрыДействий</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Enums/TelegramДействияСПараметром.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>TelegramДействияСПараметром</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Установить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Очистить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Catalogs/TelegramДействия/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.Активность = Истина;
		Алгоритм = TelegramСервер.КомментарийПредопределенныхПеременныхДействий();
		
	КонецЕсли;
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Алгоритм = ТекущийОбъект.Алгоритм.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Алгоритм = Новый ХранилищеЗначения(Алгоритм, Новый СжатиеДанных(9));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОчиститьВсеПараметрыПриИзменении(Элемент)
	
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПараметры

&НаКлиенте
Процедура ПараметрыПриАктивизацииСтроки(Элемент)
	
	ОбновитьДоступностьСтолбцаЗначениеТаблицыПараметры();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыДействиеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Параметры.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.TelegramДействияСПараметром.Очистить") Тогда
		ТекущиеДанные.Значение = "";
	КонецЕсли;
	
	ОбновитьДоступностьСтолбцаЗначениеТаблицыПараметры();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сообщение(Команда)
	
	ОткрытьФормуПодсказки(НСтр("ru = 'Отправка сообщения'"), "sendMessage", "ОтправитьСообщение");
	
КонецПроцедуры

&НаКлиенте
Процедура Фото(Команда)
	
	ОткрытьФормуПодсказки(НСтр("ru = 'Отправка фото'"), "sendPhoto", "ОтправитьФото");
	
КонецПроцедуры

&НаКлиенте
Процедура Видео(Команда)
	
	ОткрытьФормуПодсказки(НСтр("ru = 'Отправка видео'"), "sendVideo", "ОтправитьВидео");
	
КонецПроцедуры

&НаКлиенте
Процедура Файл(Команда)
	
	ОткрытьФормуПодсказки(НСтр("ru = 'Отправка файла'"), "sendDocument", "ОтправитьДокумент");
	
КонецПроцедуры

&НаКлиенте
Процедура Аудио(Команда)
	
	ОткрытьФормуПодсказки(НСтр("ru = 'Отправка аудио'"), "sendAudio", "ОтправитьАудио");
	
КонецПроцедуры

&НаКлиенте
Процедура Голосовое(Команда)
	
	ОткрытьФормуПодсказки(НСтр("ru = 'Отправка голосового сообщения'"), "sendVoice", "ОтправитьГолосовоеСообщение");
	
КонецПроцедуры

&НаКлиенте
Процедура Местоположение(Команда)
	
	ОткрытьФормуПодсказки(НСтр("ru = 'Отправка местоположения'"), "sendLocation", "ОтправитьМестоположение");
	
КонецПроцедуры

&НаКлиенте
Процедура МестоНаКарте(Команда)
	
	ОткрытьФормуПодсказки(НСтр("ru = 'Отправка места на карте'"), "sendVenue", "ОтправитьМестоНаКарте");
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьАлгоритм(Команда)
	
	Алгоритм = "";
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСообщение(Команда)
	
	ОткрытьФормуПодсказки(НСтр("ru = 'Редактирование отправленного ранее сообщения'"), "editMessageText", 
		"ИзменитьТекстСообщения");
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСообщение(Команда)
	
	ОткрытьФормуПодсказки(НСтр("ru = 'Удаление отправленного ранее сообщения'"), "deleteMessage", "УдалитьСообщение");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрДействия(Команда)
	
	ДобавитьКодВыбор(
		"УстановитьПараметрДействия(НакопленныеДанные.НастройкиБота.Ссылка, НакопленныеДанные.ИдентификаторЧата, ПараметрДействия(""<Наименование параметра>""), <Значение параметра>);",
		Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПараметрДействия(Команда)

	ДобавитьКодВыбор(
		"ЗначениеПараметра(НакопленныеДанные.Параметры, ""<Наименование параметра>"");",
		Неопределено);
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьВидимостьДоступность()
	
	Элементы.Параметры.Доступность = Объект.ОчиститьВсеПараметры = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодсказки(Знач ЗаголовокФормы, Знач Метод, Знач НазваниеПроцедуры)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Заголовок", 		ЗаголовокФормы);
	ПараметрыОткрытия.Вставить("Метод", 			Метод);
	ПараметрыОткрытия.Вставить("НазваниеПроцедуры", НазваниеПроцедуры);
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьКодВыбор", ЭтаФорма);
	ОткрытьФорму("Справочник.TelegramДействия.Форма.Подсказка", ПараметрыОткрытия,ЭтаФорма,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКодВыбор(ТекстМакета, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ТекстМакета) = Тип("Строка") Тогда
		
		Если ЗначениеЗаполнено(Алгоритм) Тогда
			РазделительКода = Символы.ПС + Символы.ПС + Символы.ПС;
		Иначе
			РазделительКода = "";
		КонецЕсли;
		
		Алгоритм = Алгоритм + РазделительКода + ТекстМакета;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСмайликВыбор(ТекстМакета, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ТекстМакета) = Тип("Строка") Тогда
		Элементы.ТекстФайла.ВыделенныйТекст = ТекстМакета;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Смайлик(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьСмайликВыбор", ЭтаФорма);
	ОткрытьФорму("Справочник.TelegramEmoji.Форма.Emoji",,ЭтаФорма,,,,ОписаниеОповещения);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьСтолбцаЗначениеТаблицыПараметры()
	
	ТекущиеДанные = Элементы.Параметры.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПараметрыЗначение.Доступность = ЗначениеЗаполнено(ТекущиеДанные.Действие)
		И ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.TelegramДействияСПараметром.Установить");
		
КонецПроцедуры

#КонецОбласти
